"""
1. Сумма трех
Посчитайте сумму трех введенных целых чисел
"""

# number1 = int(input('Введите первое число: '))
# number2 = int(input('Введите второе число: '))
# number3 = int(input('Введите третье число: '))
#
# print(number1 + number2 + number3)

"""1. Одинаковая четность
Даны два целых числа: A, B. Проверить истинность высказывания: "Числа A и B имеют одинаковую четность"."""

# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
#
# print(a % 2 == b % 2)

"""3. Последняя цифра
Дано натуральное число. Выведите его последнюю цифру."""

# a = int(input('Введите число: '))
#
# print(a % 10)

"""6. Описание числа
Пользователь вводит целое число. Выведите его строку-описание вида "отрицательное четное число", "ноль", 
"положительное нечетное число", например, численным описанием числа 190 является строка 
"положительное четное число"."""

# number = int(input('Введите число: '))
# if number > 0:
#     if number % 2 == 0:
#         print(f'Число {number} положительное четное')
#     else:
#         print(f'Число {number} положительное нечетное')
# elif number < 0:
#     if number % 2 == 0:
#         print(f'Число {number} отрицательное четное')
#     else:
#         print(f'Число {number} отрицательное нечетное')
# else:
#     print('Ноль')


"""
Задача №1. Решение в группах
Семинар 1. Ввод-вывод, операторы ветвления
За день машина проезжает n километров. Сколько
дней нужно, чтобы проехать маршрут длиной m
километров? При решении этой задачи нельзя
пользоваться условной инструкцией if и циклами.
Input:
n = 700
m = 750
Output:
2

Input:
n = 700
m = 1400

Output:
2
"""

"dfsf"